package com.github.dipodoc.webui.admin.controller.knu

import com.github.dipodoc.webui.admin.domain.data.Doc

class KnuController {

    def shevapil() {
        Doc startingPost = new Doc()
        startingPost.title = 'Довідка комісії по перевірці порядку поселення та проживання студентів та аспірантів у гуртожитках університету'
        startingPost.uri = 'http://www.univ.kiev.ua/news/6550'
        startingPost.loadTime = '12.05.2015'
        startingPost.meaningHtml = '''У зв’язку з необхідністю вивчення питання щодо порядку поселення та проживання студентів та аспірантів у гуртожитках університету наказом Ректора № від 23.04.2015р. була створена комісія по перевірці порядку поселення та проживання студентів та аспірантів у гуртожитках університету в такому складі:
Безущак Оксана Омелянівна – заступник декана з навчальної роботи механіко-математичного факультету, голова комісії;
Члени комісії:
Бачурин Ілля – перший заступник голови студентського парламенту університету;
Жуков Віктор Іванович – заступник декана з виховної роботи факультету соціології;
Кличковський Сергій – голова Студентської Ради Студентського містечка університету;
Куцевич Максим Петрович – доцент кафедри кримінального права юридичного факультету;
Оніщенко Аліна – член студентського парламенту економічного факультету.
Шамрай В’ячеслав Вікторович – заступник голови профспілкового комітету університету;
Шинкаренко Вячеслав Іванович – помічник ректора.

Результати роботи комісії відображені в даній довідці.

Діяльність комісії була спрямована на:
1) перевірку правил поселення в гуртожитки університету (на прикладі поселення студентів економічного факультету в базовий гуртожиток № 10 та гуртожиток № 9, в якому проживають також студенти економічного факультету у зв’язку з недостатньої кількістю місць у гуртожитку № 10);
2) перевірку правил переселення з метою покращення житлових умов з кімнат, в яких проживає 4 студенти, в кімнати, які розраховані на 2-х студентів;
3) підготовку пропозицій щодо оптимізації та прозорості процедури переселення студентів з одного гуртожитку в інший та з однієї кімнати в іншу.

Під час роботи у період з 24.04 по 30.04.2.15 комісія:
1) відвідала більше 30 кімнат гуртожитків № 10 та № 9, опитала їх мешканців щодо процедури та термінів їх поселення в гуртожитки, переселення з одного гуртожитку в інший та з однієї кімнати в іншу, крім того опитала мешканців та членів студентських рад гуртожитків № 4, № 5 та № 12 щодо процедури та термінів їх поселення та переселення, а також можливої інформації щодо порушень при поселенні та переселенні студентів університету;
2) перевірила протоколи засідань студентської ради гуртожитку № 10 за період з 01 вересня 2014р. по 24 квітня 2015р.;
3) провела розмови з студентами гуртожитків № 10 та № 9 щодо наявності порушень при поселенні в гуртожитки та вказаних вище видах переселень;
4) 27.04 (з 18.00 до 21.00) та 28.04 (з 08.00 до 10.00) комісією було організовано тимчасову приймальну (читальна зала, к. 312, гуртожитку № 10) для отримання письмових та усних зауважень з боку студентів щодо можливих порушень процедури поселення та переселення, а також пропозицій щодо вдосконалення цієї процедури;
5) було проведено зустрічі зі студентами та співробітниками економічного факультету, які згадуються в зверненні до Ректора від 24.04.2015р.
Інформація про початок роботи комісії була оприлюднена на сайті університету заздалегідь, інформація про роботу тимчасової приймальної для прийняття скарг і пропозицій від мешканців гуртожитків університету була оприлюднена на інформаційних стендах гуртожитків університету, вхідних дверях гуртожитків № 9 та № 10, а також через студентський актив факультетів.

За результатами перевірки:
1.\tНа основі аналізу наданих комісії документів порушень порядку поселення та переселення студентів економічного факультету не виявлено.
2.\tДо приймальної письмових звернень від студентів університету не було.
3.\tПід час проведеного опитування письмових скарг щодо процедури поселення та переселення не надійшло.
4.\tКомісія вважає за необхідне відмітити суттєве покращення процедури поселення студентів-першокурсників в університеті в 2013 та 2014 роках завдяки професійній роботі нової дирекції студентського містечка (директор С.В.Легкий, головний інспектор комісії по поселенню І.І.Лібак).

Зауваження та пропозиції комісії:
1)\tслід затвердити (на спільному засіданні студентської ради гуртожитку, студентського парламенту і студентського профбюро факультету) формалізовані критерії щодо процедури внутрішнього переселення студентів (зокрема, з кімнат з 4-місним поселенням у кімнати з 2-місним поселенням), позаяк відсутність таких критеріїв призводить до небажаних, часом необ’єктивних, нарікань студентів та співробітників гуртожитків (як усних, так і в соціальних мережах);
2)\tвдосконалити існуючі Правила переселення студентів гуртожитків в частині визначення пріоритетних категорій студентів при внутрішньому переселенні;
3)\tпокращити інформування щодо процедури поселення, переселення, виселення, проживання в літній період студентів у гуртожитках університету на інформаційних ресурсах університету;
4)\tпривести діюче Положення про порядок поселення та переселення студентів у гуртожитки університету у відповідність до Закону України про вищу освіту, звернувши увагу на необхідність чіткого розподілу повноважень між учасниками процесу поселення.


Голова комісії
О.О.Безущак

члени комісії: І.Бачурин
В.І.Жуков
С.Кличковський
М.П.Куцевич
А.Оніщенко
В.В.Шамрай
В.І.Шинкаренко '''

        [ startingPost: startingPost ]
    }
}
