package com.github.dipodoc.webui.admin.controller.knu

import com.github.dipodoc.webui.admin.domain.data.Doc

class KnuController {

    def shevapil() {
        Doc startingPost = new Doc()
        startingPost.title = 'Довідка комісії по перевірці порядку поселення та проживання студентів та аспірантів у гуртожитках університету'
        startingPost.uri = 'http://www.univ.kiev.ua/news/6550'
        startingPost.loadTime = '12.05.2015'
        startingPost.meaningHtml = startingDocText()

        List relatedSocialsList = []
        relatedSocialsList << [
            id         : 1,
            uri        : 'https://vk.com/wall-75632123_4064',
            author     : [ uri: 'https://vk.com/shevapil', name: '#ШеваПил'],
            timestamp  : '10 мая 2015 в 15:30',
            importancy : 19,
            sentiment  : '+1.7',
            text       : shevapilPost1()
        ]
        relatedSocialsList << [
            id         : 2,
            uri        : 'https://vk.com/wall-75632123_4064?reply=4065',
            author     : [ uri: 'https://vk.com/id10114271', name: 'Артур Булакаев'],
            timestamp  : '10 мая в 15:34',
            importancy : 8,
            sentiment  : '+0.8',
            text       : shevapilPost2()
        ]
        relatedSocialsList << [
            id         : 3,
            uri        : 'https://www.facebook.com/shevapil/posts/1434254690220567',
            author     : [ uri: 'https://www.facebook.com/shevapil', name: 'ШеваПил'],
            timestamp  : '21 апреля в 11:44',
            importancy : 6,
            sentiment  : '-1.3',
            text       : shevapilPost3()
        ]

        [ startingPost: startingPost, relatedSocialsList: relatedSocialsList ]
    }

    def studvote() {
        List socialsList = []
        socialsList << [
            id         : 4,
            uri        : 'https://www.facebook.com/shetelebachennya/photos/a.1528073170766340.1073741828.1523073294599661/1625783287661994',
            author     : [ uri: 'https://www.facebook.com/shetelebachennya', name: 'Ш-ТБ. Телебачення твого університету'],
            timestamp  : '24 мая 2015 в 16:45',
            importancy : 1,
            sentiment  : '+0.5',
            text       : studvotePost1()
        ]
        socialsList << [
            id         : 5,
            uri        : 'https://vk.com/wall-1915629_7180',
            author     : [ uri: 'https://vk.com/sp_knu', name: 'Студентський Парламент КНУ імені Тараса Шевченка'],
            timestamp  : '23 мая 2015 в 18:19',
            importancy : 19,
            sentiment  : '0.0',
            text       : studvotePost2()
        ]
        socialsList << [
            id         : 6,
            uri        : 'https://vk.com/wall-37616464_23331',
            author     : [ uri: 'https://vk.com/knustudents', name: 'KNUstudents'],
            timestamp  : '23 мая 2015 в 0:57',
            importancy : 15,
            sentiment  : '-1.3',
            text       : studvotePost3()
        ]

        [ socialsList: socialsList ]
    }

    private static String startingDocText() {
        '''У зв’язку з необхідністю вивчення питання щодо порядку поселення та проживання студентів та аспірантів у гуртожитках університету наказом Ректора № від 23.04.2015р. була створена комісія по перевірці порядку поселення та проживання студентів та аспірантів у гуртожитках університету в такому складі:
Безущак Оксана Омелянівна – заступник декана з навчальної роботи механіко-математичного факультету, голова комісії;
Члени комісії:
Бачурин Ілля – перший заступник голови студентського парламенту університету;
Жуков Віктор Іванович – заступник декана з виховної роботи факультету соціології;
Кличковський Сергій – голова Студентської Ради Студентського містечка університету;
Куцевич Максим Петрович – доцент кафедри кримінального права юридичного факультету;
Оніщенко Аліна – член студентського парламенту економічного факультету.
Шамрай В’ячеслав Вікторович – заступник голови профспілкового комітету університету;
Шинкаренко Вячеслав Іванович – помічник ректора.

Результати роботи комісії відображені в даній довідці.

Діяльність комісії була спрямована на:
1) перевірку правил поселення в гуртожитки університету (на прикладі поселення студентів економічного факультету в базовий гуртожиток № 10 та гуртожиток № 9, в якому проживають також студенти економічного факультету у зв’язку з недостатньої кількістю місць у гуртожитку № 10);
2) перевірку правил переселення з метою покращення житлових умов з кімнат, в яких проживає 4 студенти, в кімнати, які розраховані на 2-х студентів;
3) підготовку пропозицій щодо оптимізації та прозорості процедури переселення студентів з одного гуртожитку в інший та з однієї кімнати в іншу.

Під час роботи у період з 24.04 по 30.04.2.15 комісія:
1) відвідала більше 30 кімнат гуртожитків № 10 та № 9, опитала їх мешканців щодо процедури та термінів їх поселення в гуртожитки, переселення з одного гуртожитку в інший та з однієї кімнати в іншу, крім того опитала мешканців та членів студентських рад гуртожитків № 4, № 5 та № 12 щодо процедури та термінів їх поселення та переселення, а також можливої інформації щодо порушень при поселенні та переселенні студентів університету;
2) перевірила протоколи засідань студентської ради гуртожитку № 10 за період з 01 вересня 2014р. по 24 квітня 2015р.;
3) провела розмови з студентами гуртожитків № 10 та № 9 щодо наявності порушень при поселенні в гуртожитки та вказаних вище видах переселень;
4) 27.04 (з 18.00 до 21.00) та 28.04 (з 08.00 до 10.00) комісією було організовано тимчасову приймальну (читальна зала, к. 312, гуртожитку № 10) для отримання письмових та усних зауважень з боку студентів щодо можливих порушень процедури поселення та переселення, а також пропозицій щодо вдосконалення цієї процедури;
5) було проведено зустрічі зі студентами та співробітниками економічного факультету, які згадуються в зверненні до Ректора від 24.04.2015р.
Інформація про початок роботи комісії була оприлюднена на сайті університету заздалегідь, інформація про роботу тимчасової приймальної для прийняття скарг і пропозицій від мешканців гуртожитків університету була оприлюднена на інформаційних стендах гуртожитків університету, вхідних дверях гуртожитків № 9 та № 10, а також через студентський актив факультетів.

За результатами перевірки:
1.\tНа основі аналізу наданих комісії документів порушень порядку поселення та переселення студентів економічного факультету не виявлено.
2.\tДо приймальної письмових звернень від студентів університету не було.
3.\tПід час проведеного опитування письмових скарг щодо процедури поселення та переселення не надійшло.
4.\tКомісія вважає за необхідне відмітити суттєве покращення процедури поселення студентів-першокурсників в університеті в 2013 та 2014 роках завдяки професійній роботі нової дирекції студентського містечка (директор С.В.Легкий, головний інспектор комісії по поселенню І.І.Лібак).

Зауваження та пропозиції комісії:
1)\tслід затвердити (на спільному засіданні студентської ради гуртожитку, студентського парламенту і студентського профбюро факультету) формалізовані критерії щодо процедури внутрішнього переселення студентів (зокрема, з кімнат з 4-місним поселенням у кімнати з 2-місним поселенням), позаяк відсутність таких критеріїв призводить до небажаних, часом необ’єктивних, нарікань студентів та співробітників гуртожитків (як усних, так і в соціальних мережах);
2)\tвдосконалити існуючі Правила переселення студентів гуртожитків в частині визначення пріоритетних категорій студентів при внутрішньому переселенні;
3)\tпокращити інформування щодо процедури поселення, переселення, виселення, проживання в літній період студентів у гуртожитках університету на інформаційних ресурсах університету;
4)\tпривести діюче Положення про порядок поселення та переселення студентів у гуртожитки університету у відповідність до Закону України про вищу освіту, звернувши увагу на необхідність чіткого розподілу повноважень між учасниками процесу поселення.


Голова комісії
О.О.Безущак

члени комісії: І.Бачурин
В.І.Жуков
С.Кличковський
М.П.Куцевич
А.Оніщенко
В.В.Шамрай
В.І.Шинкаренко'''
    }

    private static String shevapilPost1() {
        '''Итак, все вы помните как после нескольких неудачных попыток нам таки удалось добиться проведения "ректорской проверки" в вопросе процедуры поселения в общежитие номер 10.

Если не помните, то предыстория: https://vk.com/shevapil?w=wall-75632123_3685

Бутенко ушла в отпуск, комиссия ходила по общежитиям, все ликовали, радовались и было ощущение какой-то частичной победы, но.

Но вот появились результаты этой злополучной комиссии:

- "порушень не виявлено";
- "скарг не виявлено";
- "відмітити ПОКРАЩЕННЯ процедури поселення" с оказанием благодарности дирекции Студгородка;

Понятно, что эти три фразы пишутся не для вас, не для нас, а для Леонида Васильевича, чтобы можно было принести ему на стол эту бумажку и рассказать "как у нас в #КНУ все хорошо, Студгородок в нормальных хозяйственных руках, все красиво, все довольны".

Но нас в этом отчете привлекло не это, а другое.

В отчете указано, что комиссия самым тщательным образом изучила протоколы поселения в "двойки" от СР и пришла к выводу, что - все нормально, нарушений не заметили.

Но при этом все мы знаем и видели эти протоколы, что по ним в те же "двойки" селили первокурсников, когда критерии поселения это:

- соцактивность; - успеваемость;

Когда ты поступаешь на первый курс и тебя сразу селят в "двойку", когда ты не успел еще проявить ни успевамость, ни по субботникам нормально отходить - это, как минимум, странно. Мы не утверждаем, что здесь есть коррупционная составляющая, но проверить было бы неплохо.

Есть же фамилии, есть номера комнат. Вот и напишем еще пару бумажек, обратим внимание.

Ну а что, вдруг не заметили?

#КНУ #Общагейт #ШеваПил #ЭФ'''
    }

    private static String shevapilPost2() {
        'Итак, вы пришли к закономерному финалу по системной ветке. Как и ожидалось, администрация не будет обличать саму себя =) А дальше что?'
    }

    private static String shevapilPost3() {
        '''Студактивисты ‪#‎ЭФ‬ срывают сбор подписей ‪#‎ШеваПил‬ (самый Ад за 6 минут)
https://www.youtube.com/watch?v=5DCsY3x5rRI
Предыстория (для тех, кто не в курсе):
Антикоррупционная студенческая инициатива #ШеваПил получила много жалоб от студентов на коррупцию в 10ом общежитии ЭФ.
Администрация ‪#‎КНУ‬ в лице первого про-ректора ответила, что "мало ли кто что пишет, ваше слово на их, пусть студенты открыто заявят".
Было принято решение собрать подписи у студентов Экономического за требование проведения служебных проверокв общежитии номер 10, в частности проверить на причастие к коррупционным схемам зам. декана Бутенко Н.В., работника общежития и аспиранта факультета Качалая В.В.
Первый сбор подписей был сорван местными студактивистами и представителями Администрации факультета, подписи были отобраны.
(подробнее - https://vk.com/shevapil?w=wall-75632123_2842)
Второй сбор подписей и что из этого вышло вы можете посмотреть на видео. Ссылка на пост:
https://vk.com/shevapil?w=wall-75632123_3483
Следующие новости ожидайте уже в ближайшее время и, поверьте, нам есть что рассказать.
Больше информации на: vk.com/shevapil
‪#‎Общагейт‬'''
    }

    private static String studvotePost1() {
        '''26 травня відбудуться вибори на пост голови студпарламенту університету. Ми вирішили зробити свої альтернативні Ш-Дебати серед кандидатів на цей пост.

Переглянути: https://www.youtube.com/watch?v=s9YJokPdn5I

Також прикріплюємо повний запис офіційних дебатів, що відбувся 22 травня в червоному корпусі:
https://www.youtube.com/watch?v=oUEnhoLA79Y

Кандидати:
Максим Бурдюг - філософський факультет
Костянтин Лапчевський - радіофізичний факультет
Станіслав Тихонько - філософський факультет
Данііл Циганок - фізичний факультет

Висловлюємо подяку Ксенії Барановій за надане приміщення Читалки для проведення зйомки.

Інтерв'ю:
Віталій Капустян, факультет соціології
Зйомка:
Олександр Попенко, фізичний факультет
Анастасія Новобранець, інститут міжнародних відносин
Монтаж:
Олександр Попенко, фізичний факультет

Новини стосуються кожного!'''
    }

    private static String studvotePost2() {
        '''УВАГА!!! ВИБОРИ!!!

Вибори Голови СПУ та членів Вченої ради Університету відбудуться у вівторок 26 травня 2015 року!

Виборчі дільниці, список яких додається до цього посту з адресами та переліком факультетів/Інститутів, які на них голосують, працюватимуть з 9.15 до 19.45!

На посаду Голови СПУ претендує вже 3 кандидати! Кандидат Лапчевський Костянтин зняв свою кандидатуру з перегонів!

1. ЧЕРВОНИЙ КОРПУС (ІСТОРИЧНИЙ ФАКУЛЬТЕТ, ФІЛОСОФСЬКИЙ ФАКУЛЬТЕТ, ЮРИДИЧНИЙ ФАКУЛЬТЕТ) - Вул. Володимирська 60

2. ІНСТИТУТ ФІЛОЛОГІЇ - Бульвар Т. Шевченка, 14

3. ХІМІЧНИЙ ФАКУЛЬТЕТ (ХІМІЧНИЙ ФАКУЛЬТЕТ, Оптико-механічний коледж, Коледж геологорозвідувальних технологій) - Вул. Володимирська 62а

4. ЕКОНОМІЧНИЙ ФАКУЛЬТЕТ (ЕКОНОМІЧНИЙ ФАКУЛЬТЕТ, ІНСТИТУТ ГЕОЛОГІЇ) - Вул. Васильківська, 90а

5. ФІЗИЧНИЙ ФАКУЛЬТЕТ (ФРЕКС, ФІЗИЧНИЙ ФАКУЛЬТЕТ, ФІТ) - Просп. Глушкова 4

6. ФАКУЛЬТЕТ КІБЕРНЕТИКИ (ФАКУЛЬТЕТ КІБЕРНЕТИКИ, МЕХАНІКО-МАТЕМАТИЧНИЙ, ІВТ, СОЦІОЛОГИ) - Просп. Глушкова, 4д

7. ГЕОГРАФІЧНИЙ ФАКУЛЬТЕТ (ГЕОГРАФІЧНИЙ ФАКУЛЬТЕТ, ФАКУЛЬТЕТ ПСИХОЛОГІЇ, ІНСТИТУТ БІОЛОГІЇ) - Проспект Глушкова, 2а

8. ІНСТИТУТ МІЖНАРОДНИХ ВІДНОСИН, ІНСТИТУТ ЖУРНАЛІСТИКИ - вул. Мельникова, 36/1

Матеріали щодо виборів: http://vk.com/sp_knu?w=wall-1915629_7131 (текстовий стрім з дебатів)
http://vk.com/sp_knu?w=wall-1915629_7112
http://vk.com/sp_knu?w=wall-1915629_7091
http://vk.com/sp_knu?w=wall-1915629_7040
http://vk.com/sp_knu?w=wall-1915629_7023

Правила голосування:

Голосувати мають право студенти КНУ лише за наявності студентського квитка чи залікової книжки!

1) За голову СПУ: у бюлетнях ставиться 1 (ОДНА) позначка в полі для голосування. Позначки поза клітинкою для голосування не враховуватимуться. Бюлетені з більшою кількістю позначок або ж де не можна встановити волю виборця вважатимуться зіпсованими.

2) За членів Вченої ради: у бюлетнях ставиться 8 (ВІСІМ) позначок в полі для голосування. Позначки поза клітинкою для голосування не враховуватимуться. Бюлетені з більшою чи меншою кількістю позначок або ж де не можна встановити волю виборця вважатимуться зіпсованими.'''
    }

    private static String studvotePost3() {
        '''Небольшие итоги сегодняшних дебатов кандидатов на пост главы студ.парламента #КНУ
(трансляция тут http://vk.com/wall-37616464_23197)

Перечитали нашу трансляцию дебатов и поняли, что текст не передает того, что было на самом деле. В нашей трансляции кандидаты кажутся слишком умными, опытными и логичными. На самом деле часто это было не так. Поэтому очень советуем посмотреть видео (Ш-ТБ должно скоро выложить).

Если анализировать то, что говорили кандидаты и как отвечали на поставленный вопросы, то лучше всего это озвучила нынешняя глава студ.парламента Инна Степанец - вы все не имеете ни малейшего понятия какие права и обязанности есть у студентов. Честно говоря, мы ее в этом поддерживаем.

Все кандидаты раскидывались словами, в которые не вкладывался никакой конкретный смысл. Это показали вопросы от главы ЦВК и нынешней главы студ.парламента о правах и обязанностях студентов. Кстати, самое популярное слово, которое сегодня звучало было "популизм".

Было видно, что в описании нынешней ситуации в университете кандидаты пользовались трендами, а не реальными проблемами. Все называли такие проблемы как то плохая информационная политика университета;
в Шеве все плохо,Шева дно, а у других хорошо;
коррупция на факультетах, нужно с ней бороться.

И тут возникает противоречие: все говорят про коррупцию, но никто ее не видел (Станислав Тихонько подтвердил это). Жалобы, что администрация университета не представлена в соц.сетях - а на самом деле тому как оперативно отвечает Владимир Анатольевич Бугров на вопросы и проблемы студентов может позавидовать и #КПИ и Могилянка.

Что хотелось бы сказать: ребята, реальные цели должны быть конкретны, количественно выражены и ограничены временными рамками. Иначе это все треп и икрометание. Студенты ведь не дураки, мы видим что вы просто болтаете.

Итог. Очень здорово, что у нас в университете проходят такие выборы, дебаты. Но, честно говоря, мы глубоко задумались за кого голосовать. Назрел вопрос: кандидаты действительно хотят сделать университет лучше или хотят доказать всем, что они классные?

#КНУвибори'''
    }
}
